[Killed] ArrayDeclaration
src/cors.ts:3:25
 import type { Env } from './types';
 
-const ALLOWED_ORIGINS = [
-  'https://panel.mizcor.dev',
-  'http://localhost:5173',
-];
+const ALLOWED_ORIGINS = [];
 
 export function resolveOrigin(request: Request, env: Env): string {
killedBy: resolveOrigin [U-W-04] retorna el origen cuando esta en la allowlist hardcoded (panel.mizcor.dev)
statusReason: expected undefined to be 'https://panel.mizcor.dev' // Object.is equality

[Killed] StringLiteral
src/cors.ts:4:3
 import type { Env } from './types';
 
 const ALLOWED_ORIGINS = [
-  'https://panel.mizcor.dev',
+  "",
   'http://localhost:5173',
 ];
killedBy: resolveOrigin [U-W-04] retorna el origen cuando esta en la allowlist hardcoded (panel.mizcor.dev)
statusReason: expected '' to be 'https://panel.mizcor.dev' // Object.is equality

[Killed] BlockStatement
src/cors.ts:8:67
   'http://localhost:5173',
 ];
 
-export function resolveOrigin(request: Request, env: Env): string {
-  const reqOrigin = request.headers.get('Origin') ?? '';
-  // Check against allowed list; fall back to env config or wildcard
-  if (ALLOWED_ORIGINS.includes(reqOrigin)) return reqOrigin;
-  if (env.ALLOWED_ORIGIN && reqOrigin === env.ALLOWED_ORIGIN) return reqOrigin;
-  return ALLOWED_ORIGINS[0];
-}
+export function resolveOrigin(request: Request, env: Env): string {}
 
 export function corsHeaders(origin: string) {
killedBy: resolveOrigin [U-W-04] retorna el origen cuando esta en la allowlist hardcoded (panel.mizcor.dev)
statusReason: expected undefined to be 'https://panel.mizcor.dev' // Object.is equality

[Killed] LogicalOperator
src/cors.ts:9:21
 ];
 
 export function resolveOrigin(request: Request, env: Env): string {
-  const reqOrigin = request.headers.get('Origin') ?? '';
+  const reqOrigin = request.headers.get('Origin') && '';
   // Check against allowed list; fall back to env config or wildcard
   if (ALLOWED_ORIGINS.includes(reqOrigin)) return reqOrigin;
killedBy: resolveOrigin [U-W-04] retorna el origen cuando esta en la allowlist hardcoded (localhost:5173)
statusReason: expected 'https://panel.mizcor.dev' to be 'http://localhost:5173' // Object.is equality

[Killed] ConditionalExpression
src/cors.ts:11:7
 export function resolveOrigin(request: Request, env: Env): string {
   const reqOrigin = request.headers.get('Origin') ?? '';
   // Check against allowed list; fall back to env config or wildcard
-  if (ALLOWED_ORIGINS.includes(reqOrigin)) return reqOrigin;
+  if (false) return reqOrigin;
   if (env.ALLOWED_ORIGIN && reqOrigin === env.ALLOWED_ORIGIN) return reqOrigin;
   return ALLOWED_ORIGINS[0];
killedBy: resolveOrigin [U-W-04] retorna el origen cuando esta en la allowlist hardcoded (localhost:5173)
statusReason: expected 'https://panel.mizcor.dev' to be 'http://localhost:5173' // Object.is equality

[Killed] ConditionalExpression
src/cors.ts:11:7
 export function resolveOrigin(request: Request, env: Env): string {
   const reqOrigin = request.headers.get('Origin') ?? '';
   // Check against allowed list; fall back to env config or wildcard
-  if (ALLOWED_ORIGINS.includes(reqOrigin)) return reqOrigin;
+  if (true) return reqOrigin;
   if (env.ALLOWED_ORIGIN && reqOrigin === env.ALLOWED_ORIGIN) return reqOrigin;
   return ALLOWED_ORIGINS[0];
killedBy: resolveOrigin [U-W-04] retorna el fallback cuando el origen no esta autorizado
statusReason: expected 'https://evil.com' to be 'https://panel.mizcor.dev' // Object.is equality

[Killed] ConditionalExpression
src/cors.ts:12:7
   const reqOrigin = request.headers.get('Origin') ?? '';
   // Check against allowed list; fall back to env config or wildcard
   if (ALLOWED_ORIGINS.includes(reqOrigin)) return reqOrigin;
-  if (env.ALLOWED_ORIGIN && reqOrigin === env.ALLOWED_ORIGIN) return reqOrigin;
+  if (true) return reqOrigin;
   return ALLOWED_ORIGINS[0];
 }
killedBy: resolveOrigin [U-W-04] retorna el fallback cuando el origen no esta autorizado
statusReason: expected 'https://evil.com' to be 'https://panel.mizcor.dev' // Object.is equality

[Killed] ConditionalExpression
src/cors.ts:12:7
   const reqOrigin = request.headers.get('Origin') ?? '';
   // Check against allowed list; fall back to env config or wildcard
   if (ALLOWED_ORIGINS.includes(reqOrigin)) return reqOrigin;
-  if (env.ALLOWED_ORIGIN && reqOrigin === env.ALLOWED_ORIGIN) return reqOrigin;
+  if (false) return reqOrigin;
   return ALLOWED_ORIGINS[0];
 }
killedBy: resolveOrigin [U-W-04] retorna el origen cuando coincide con env.ALLOWED_ORIGIN
statusReason: expected 'https://panel.mizcor.dev' to be 'https://staging.mizcor.dev' // Object.is equality

[Killed] BlockStatement
src/cors.ts:16:45
   return ALLOWED_ORIGINS[0];
 }
 
-export function corsHeaders(origin: string) {
-  return {
-    'Access-Control-Allow-Origin': origin,
-    'Access-Control-Allow-Methods': 'GET, POST, DELETE, PATCH, OPTIONS',
-    'Access-Control-Allow-Headers': 'Content-Type, X-API-Key, X-Client-ID, X-Confirmed-Name',
-    'Vary': 'Origin',
-  };
-}
+export function corsHeaders(origin: string) {}
 
 export function json(data: unknown, status = 200, origin = '*') {
killedBy: corsHeaders [U-W-05] incluye Access-Control-Allow-Origin reflejando el parametro
statusReason: Cannot read properties of undefined (reading 'Access-Control-Allow-Origin')

[Killed] ObjectLiteral
src/cors.ts:17:10
 }
 
 export function corsHeaders(origin: string) {
-  return {
-    'Access-Control-Allow-Origin': origin,
-    'Access-Control-Allow-Methods': 'GET, POST, DELETE, PATCH, OPTIONS',
-    'Access-Control-Allow-Headers': 'Content-Type, X-API-Key, X-Client-ID, X-Confirmed-Name',
-    'Vary': 'Origin',
-  };
+  return {};
 }
 
killedBy: corsHeaders [U-W-05] incluye Access-Control-Allow-Origin reflejando el parametro
statusReason: expected undefined to be 'https://panel.mizcor.dev' // Object.is equality

[NoCoverage] BlockStatement
src/cors.ts:25:65
   };
 }
 
-export function json(data: unknown, status = 200, origin = '*') {
-  return new Response(JSON.stringify(data), {
-    status,
-    headers: { 'Content-Type': 'application/json', ...corsHeaders(origin) },
-  });
-}
+export function json(data: unknown, status = 200, origin = '*') {}
 
