[Killed] StringLiteral
src/validators.ts:10:3
 const ALLOWED_MIME_TYPES = new Set([
   'image/jpeg',
   'image/png',
-  'image/webp',
+  "",
   'image/gif',
   'image/svg+xml',
killedBy: isAllowedMimeType [U-W-08] acepta image/webp
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/validators.ts:12:3
   'image/png',
   'image/webp',
   'image/gif',
-  'image/svg+xml',
+  "",
   'image/avif',
 ]);
killedBy: isAllowedMimeType [U-W-08] acepta image/svg+xml
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/validators.ts:17:3
 ]);
 
 const ALLOWED_CACHE_VALUES = new Set([
-  'public, max-age=31536000, immutable',
+  "",
   'public, max-age=15768000, immutable',
   'public, max-age=2592000, immutable',
killedBy: isAllowedCacheControl [U-W-10] acepta public, max-age=31536000, immutable
statusReason: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
src/validators.ts:27:36
 const ALLOWED_MAX_AGES_SET = new Set<number>(ALLOWED_MAX_AGES);
 
 /** U-W-09 */
-export const MAX_FILE_SIZE_BYTES = 10 * 1024 * 1024;
+export const MAX_FILE_SIZE_BYTES = 10 / 1024 * 1024;
 
 /** U-W-08 */

[Survived] ArithmeticOperator
src/validators.ts:27:36
 const ALLOWED_MAX_AGES_SET = new Set<number>(ALLOWED_MAX_AGES);
 
 /** U-W-09 */
-export const MAX_FILE_SIZE_BYTES = 10 * 1024 * 1024;
+export const MAX_FILE_SIZE_BYTES = 10 * 1024 / 1024;
 
 /** U-W-08 */

[Killed] BlockStatement
src/validators.ts:30:62
 export const MAX_FILE_SIZE_BYTES = 10 * 1024 * 1024;
 
 /** U-W-08 */
-export function isAllowedMimeType(mimeType: string): boolean {
-  return ALLOWED_MIME_TYPES.has(mimeType);
-}
+export function isAllowedMimeType(mimeType: string): boolean {}
 
 /** U-W-09 */
killedBy: isAllowedMimeType [U-W-08] acepta image/jpeg
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/validators.ts:35:63
 }
 
 /** U-W-09 */
-export function isFileSizeAllowed(sizeBytes: number): boolean {
-  return sizeBytes <= MAX_FILE_SIZE_BYTES;
-}
+export function isFileSizeAllowed(sizeBytes: number): boolean {}
 
 /** U-W-10 */
killedBy: isFileSizeAllowed [U-W-09] acepta 0 bytes (archivo vacío)
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/validators.ts:36:10
 
 /** U-W-09 */
 export function isFileSizeAllowed(sizeBytes: number): boolean {
-  return sizeBytes <= MAX_FILE_SIZE_BYTES;
+  return sizeBytes > MAX_FILE_SIZE_BYTES;
 }
 
killedBy: isFileSizeAllowed [U-W-09] acepta 0 bytes (archivo vacío)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/validators.ts:36:10
 
 /** U-W-09 */
 export function isFileSizeAllowed(sizeBytes: number): boolean {
-  return sizeBytes <= MAX_FILE_SIZE_BYTES;
+  return false;
 }
 
killedBy: isFileSizeAllowed [U-W-09] acepta 0 bytes (archivo vacío)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/validators.ts:40:63
 }
 
 /** U-W-10 */
-export function isAllowedCacheControl(value: string): boolean {
-  return ALLOWED_CACHE_VALUES.has(value);
-}
+export function isAllowedCacheControl(value: string): boolean {}
 
 /** U-W-11 */
killedBy: isAllowedCacheControl [U-W-10] acepta public, max-age=31536000, immutable
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/validators.ts:45:70
 }
 
 /** U-W-11 */
-export function resolveMaxAge(requested: number | undefined): number {
-  return typeof requested === 'number' && ALLOWED_MAX_AGES_SET.has(requested)
-    ? requested
-    : 31536000;
-}
+export function resolveMaxAge(requested: number | undefined): number {}
 
 /** U-W-07 */
killedBy: resolveMaxAge [U-W-11] retorna 31536000 cuando se pide 31536000
statusReason: expected undefined to be 31536000 // Object.is equality

[Killed] ConditionalExpression
src/validators.ts:46:10
 
 /** U-W-11 */
 export function resolveMaxAge(requested: number | undefined): number {
-  return typeof requested === 'number' && ALLOWED_MAX_AGES_SET.has(requested)
+  return false
     ? requested
     : 31536000;
killedBy: resolveMaxAge [U-W-11] retorna 15768000 cuando se pide 15768000
statusReason: expected 31536000 to be 15768000 // Object.is equality

[Killed] EqualityOperator
src/validators.ts:46:10
 
 /** U-W-11 */
 export function resolveMaxAge(requested: number | undefined): number {
-  return typeof requested === 'number' && ALLOWED_MAX_AGES_SET.has(requested)
+  return typeof requested !== 'number' && ALLOWED_MAX_AGES_SET.has(requested)
     ? requested
     : 31536000;
killedBy: resolveMaxAge [U-W-11] retorna 15768000 cuando se pide 15768000
statusReason: expected 31536000 to be 15768000 // Object.is equality

[Killed] BlockStatement
src/validators.ts:52:80
 }
 
 /** U-W-07 */
-export function sanitizeEndpoint(endpoint: string, bucketName: string): string {
-  return endpoint
-    .trim()
-    .replace(/\/+$/, '')
-    .replace(new RegExp(`/${bucketName}$`), '');
-}
+export function sanitizeEndpoint(endpoint: string, bucketName: string): string {}
 
killedBy: sanitizeEndpoint [U-W-07] no modifica un endpoint ya limpio
statusReason: expected undefined to be 'https://abc.r2.cloudflarestorage.com' // Object.is equality

[Killed] MethodExpression
src/validators.ts:53:10
 
 /** U-W-07 */
 export function sanitizeEndpoint(endpoint: string, bucketName: string): string {
-  return endpoint
-    .trim()
+  return endpoint
     .replace(/\/+$/, '')
     .replace(new RegExp(`/${bucketName}$`), '');
killedBy: sanitizeEndpoint [U-W-07] elimina espacios del inicio y fin (trim)
statusReason: expected '  https://abc.r2.cloudflarestorage.co…' to be 'https://abc.r2.cloudflarestorage.com' // Object.is equality
