[Killed] BlockStatement
src/crypto.ts:3:51
 import type { ClientCredentials, EncryptedBlob } from './types';
 
-function base64ToBuffer(b64: string): ArrayBuffer {
-  const binary = atob(b64);
-  const bytes = new Uint8Array(binary.length);
-  for (let i = 0; i < binary.length; i++) bytes[i] = binary.charCodeAt(i);
-  return bytes.buffer;
-}
+function base64ToBuffer(b64: string): ArrayBuffer {}
 
 function bufferToBase64(buf: ArrayBuffer): string {
killedBy: encryptCredentials/decryptCredentials — roundtrip [U-W-01] descifra exactamente lo que se cifró — credenciales típicas ASCII
statusReason: Failed to execute 'importKey' on 'SubtleCrypto': 2nd argument is not instance of ArrayBuffer, Buffer, TypedArray, or DataView.

[Killed] ConditionalExpression
src/crypto.ts:6:19
 function base64ToBuffer(b64: string): ArrayBuffer {
   const binary = atob(b64);
   const bytes = new Uint8Array(binary.length);
-  for (let i = 0; i < binary.length; i++) bytes[i] = binary.charCodeAt(i);
+  for (let i = 0; false; i++) bytes[i] = binary.charCodeAt(i);
   return bytes.buffer;
 }
killedBy: encryptCredentials/decryptCredentials — roundtrip [U-W-01] descifra exactamente lo que se cifró — credenciales típicas ASCII
statusReason: The operation failed for an operation-specific reason

[Killed] EqualityOperator
src/crypto.ts:6:19
 function base64ToBuffer(b64: string): ArrayBuffer {
   const binary = atob(b64);
   const bytes = new Uint8Array(binary.length);
-  for (let i = 0; i < binary.length; i++) bytes[i] = binary.charCodeAt(i);
+  for (let i = 0; i >= binary.length; i++) bytes[i] = binary.charCodeAt(i);
   return bytes.buffer;
 }
killedBy: encryptCredentials/decryptCredentials — roundtrip [U-W-01] descifra exactamente lo que se cifró — credenciales típicas ASCII
statusReason: The operation failed for an operation-specific reason

[Killed] BlockStatement
src/crypto.ts:10:51
   return bytes.buffer;
 }
 
-function bufferToBase64(buf: ArrayBuffer): string {
-  const bytes = new Uint8Array(buf);
-  let binary = '';
-  for (let i = 0; i < bytes.length; i++) binary += String.fromCharCode(bytes[i]);
-  return btoa(binary);
-}
+function bufferToBase64(buf: ArrayBuffer): string {}
 
 async function importKey(masterKeyB64: string): Promise<CryptoKey> {
killedBy: encryptCredentials/decryptCredentials — roundtrip [U-W-01] descifra exactamente lo que se cifró — credenciales típicas ASCII
statusReason: The string to be decoded is not correctly encoded.

[Killed] ConditionalExpression
src/crypto.ts:13:19
 function bufferToBase64(buf: ArrayBuffer): string {
   const bytes = new Uint8Array(buf);
   let binary = '';
-  for (let i = 0; i < bytes.length; i++) binary += String.fromCharCode(bytes[i]);
+  for (let i = 0; false; i++) binary += String.fromCharCode(bytes[i]);
   return btoa(binary);
 }
killedBy: encryptCredentials/decryptCredentials — roundtrip [U-W-01] descifra exactamente lo que se cifró — credenciales típicas ASCII
statusReason: The provided data is too small.

[Killed] AssignmentOperator
src/crypto.ts:13:42
 function bufferToBase64(buf: ArrayBuffer): string {
   const bytes = new Uint8Array(buf);
   let binary = '';
-  for (let i = 0; i < bytes.length; i++) binary += String.fromCharCode(bytes[i]);
+  for (let i = 0; i < bytes.length; i++) binary -= String.fromCharCode(bytes[i]);
   return btoa(binary);
 }
killedBy: encryptCredentials/decryptCredentials — roundtrip [U-W-01] descifra exactamente lo que se cifró — credenciales típicas ASCII
statusReason: The provided data is too small.

[Killed] BlockStatement
src/crypto.ts:17:68
   return btoa(binary);
 }
 
-async function importKey(masterKeyB64: string): Promise<CryptoKey> {
-  const raw = base64ToBuffer(masterKeyB64);
-  return crypto.subtle.importKey('raw', raw, 'AES-GCM', false, ['encrypt', 'decrypt']);
-}
+async function importKey(masterKeyB64: string): Promise<CryptoKey> {}
 
 export async function encryptCredentials(
killedBy: encryptCredentials/decryptCredentials — roundtrip [U-W-01] descifra exactamente lo que se cifró — credenciales típicas ASCII
statusReason: Failed to execute 'encrypt' on 'SubtleCrypto': 2nd argument is not of type CryptoKey.

[Survived] BooleanLiteral
src/crypto.ts:19:57
 
 async function importKey(masterKeyB64: string): Promise<CryptoKey> {
   const raw = base64ToBuffer(masterKeyB64);
-  return crypto.subtle.importKey('raw', raw, 'AES-GCM', false, ['encrypt', 'decrypt']);
+  return crypto.subtle.importKey('raw', raw, 'AES-GCM', true, ['encrypt', 'decrypt']);
 }
 

[Killed] ArrayDeclaration
src/crypto.ts:19:64
 
 async function importKey(masterKeyB64: string): Promise<CryptoKey> {
   const raw = base64ToBuffer(masterKeyB64);
-  return crypto.subtle.importKey('raw', raw, 'AES-GCM', false, ['encrypt', 'decrypt']);
+  return crypto.subtle.importKey('raw', raw, 'AES-GCM', false, []);
 }
 
killedBy: encryptCredentials/decryptCredentials — roundtrip [U-W-01] descifra exactamente lo que se cifró — credenciales típicas ASCII
statusReason: Usages cannot be empty when importing a secret key.

[Killed] BlockStatement
src/crypto.ts:25:27
 export async function encryptCredentials(
   creds: ClientCredentials,
   masterKeyB64: string,
-): Promise<EncryptedBlob> {
-  const key = await importKey(masterKeyB64);
-  const iv = crypto.getRandomValues(new Uint8Array(12));
-  const encoded = new TextEncoder().encode(JSON.stringify(creds));
-  const encrypted = await crypto.subtle.encrypt({ name: 'AES-GCM', iv }, key, encoded);
-  return {
-    iv: bufferToBase64(iv.buffer),
-    data: bufferToBase64(encrypted),
-  };
-}
+): Promise<EncryptedBlob> {}
 
 export async function decryptCredentials(
killedBy: encryptCredentials/decryptCredentials — roundtrip [U-W-01] descifra exactamente lo que se cifró — credenciales típicas ASCII
statusReason: Cannot read properties of undefined (reading 'iv')

[Killed] BlockStatement
src/crypto.ts:39:31
 export async function decryptCredentials(
   blob: EncryptedBlob,
   masterKeyB64: string,
-): Promise<ClientCredentials> {
-  const key = await importKey(masterKeyB64);
-  const iv = new Uint8Array(base64ToBuffer(blob.iv));
-  const data = base64ToBuffer(blob.data);
-  const decrypted = await crypto.subtle.decrypt({ name: 'AES-GCM', iv }, key, data);
-  return JSON.parse(new TextDecoder().decode(decrypted));
-}
+): Promise<ClientCredentials> {}
 
killedBy: encryptCredentials/decryptCredentials — roundtrip [U-W-01] descifra exactamente lo que se cifró — credenciales típicas ASCII
statusReason: expected undefined to deeply equal { …(2) }
